# language: uk
Функціонал: Логін на сторінці Practice Expand Testing

  Передумова:
    Дано я відкриваю сторінку логіну

  Сценарій: Успішний логін з валідними даними
    Коли я вводжу коректний логін і пароль
    І я натискаю кнопку "Login"
    Тоді я бачу повідомлення "You logged into a secure area!"
    Тоді URL містить "/secure"

  Сценарій: Логін з невалідним логіном
    Коли я вводжу невалідний логін і валідний пароль
    І я натискаю кнопку "Login"
    Тоді я бачу повідомлення "Your username is invalid!"
    Тоді URL містить "/login"

  Сценарій: Логін з порожніми полями
    Коли я не заповнюю поля логіну і пароля
    І я натискаю кнопку "Login"
    Тоді я бачу повідомлення "Your username is invalid!"
    Тоді URL містить "/login"

  Сценарій: Логаут із захищеної сторінки
    Дано я зайшла у систему з валідними обліковими даними
    Коли я натискаю кнопку "Logout"
    Тоді я бачу повідомлення "You logged out of the secure area!"
    Тоді URL містить "/login"
